package com.behnamuix.retrofittest.SpyGame.model

import kotlin.String

data class Agent(val title: String, val desc: String)

data class Spy(
    val hadaf: String = "پنهان کردن هویت هود فریب عاملان و در نسخه هایی که مکان و موضوع دارن حدس زدن درست مکان یا موضوع",
    val etelaat: String = "میداند که خودش جاسوس است هویت سایر جاسوسان را نمیداند و مکان یا موضوع را نمیداند ",
    val taghlid: String = "سعی میکند پاسخ هایی شبیه پاسخ های مامورانئ بدهد اما بدون دادن اطلاعات دقیق درباره مکان یا موضوع ",
    val penhankari: String = "تمام تلاش خود را میکند تا طوری رفتار کند که انگار یک مامور است",
    val gooshdadanFaal: String = "با دقت به سوالات ماموران گوش میدهد تا سرنخ هایی درباره مکان یا موضوع مخفی به دست آورد ",
    val gomrahKardan: String = "ممکن است با طرح سوالات یا دادن پاسخ های دروغین ماموران را به سمت افراد اشتباهی هدایت میکند",
    val hadsZadan: String = "اگر بازی شامل حدس زدن مکان باشد زمانی که احساس کرد اطلاعات کافی دارد باید جرات حدس زدن را داشته باشد",
    val chalesh: String = "باید تعادلی بین پنهان کردن هویت و جمع آوری اطلاعات برای حدس زدن مکان برقرار کند بدون اینکهپاسخ هایش آنقدر مبهم باشد که بلافاصله مشکوک شود",
)




